In [ ]:
import pandas as pd

In [ ]:
data = {
'a':[2,3,4,5],
'b':[8,6,4,2],
'c':[8,5,2,5],
'd':["sudh","pawan","krish","navin"]
}

In [ ]:
df = pd.DataFrame(data)

In [ ]:
df

In [ ]:
df.set_index('a'  ,inplace = True)
# now a convert to index

In [ ]:
df

In [ ]:
df.reset_index(inplace = True)

In [ ]:
df

In [31]:
data = {
'a':[2,3,4,5],
'b':[8,6,4,2],
'c':[8,5,2,5],
'd':["sudh","pawan","krish","navin"]
}
df1 = pd.DataFrame(data , index = ['x','y','z','u'])
df1

   a  b  c      d
x  2  8  8   sudh
y  3  6  5  pawan
z  4  4  2  krish
u  5  2  5  navin

In [33]:
df1.reindex(['z','x','u','y'])

   a  b  c      d
z  4  4  2  krish
x  2  8  8   sudh
u  5  2  5  navin
y  3  6  5  pawan

In [34]:
df1

   a  b  c      d
x  2  8  8   sudh
y  3  6  5  pawan
z  4  4  2  krish
u  5  2  5  navin

In [37]:
# Iteration
df1.iterrows()

In [39]:
for i in df1.iterrows():
    print(i)
#     return every row data in the form of tuples

('x', a       2
b       8
c       8
d    sudh
Name: x, dtype: object)
('y', a        3
b        6
c        5
d    pawan
Name: y, dtype: object)
('z', a        4
b        4
c        2
d    krish
Name: z, dtype: object)
('u', a        5
b        2
c        5
d    navin
Name: u, dtype: object)

In [42]:
for i,j in df1.iterrows():
    print("rows = " , i , "\ndata : " , j)

rows =  x
data :  a       2
b       8
c       8
d    sudh
Name: x, dtype: object
rows =  y
data :  a        3
b        6
c        5
d    pawan
Name: y, dtype: object
rows =  z
data :  a        4
b        4
c        2
d    krish
Name: z, dtype: object
rows =  u
data :  a        5
b        2
c        5
d    navin
Name: u, dtype: object

In [43]:
for i in df1.iteritems():
    print(i)
#     now it will base on column

('a', x    2
y    3
z    4
u    5
Name: a, dtype: int64)
('b', x    8
y    6
z    4
u    2
Name: b, dtype: int64)
('c', x    8
y    5
z    2
u    5
Name: c, dtype: int64)
('d', x     sudh
y    pawan
z    krish
u    navin
Name: d, dtype: object)

/tmp/ipykernel_1641/549805685.py:1: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for i in df1.iteritems():

In [44]:
for col_name , column in df1.iteritems():
    print(col_name, column)

a x    2
y    3
z    4
u    5
Name: a, dtype: int64
b x    8
y    6
z    4
u    2
Name: b, dtype: int64
c x    8
y    5
z    2
u    5
Name: c, dtype: int64
d x     sudh
y    pawan
z    krish
u    navin
Name: d, dtype: object

/tmp/ipykernel_1641/1959911163.py:1: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for col_name , column in df1.iteritems():

In [45]:
df['a']

0    2
1    3
2    4
3    5
Name: a, dtype: int64

In [48]:
[i for i in df['a'] ]

[2, 3, 4, 5]

In [50]:
list(df['a'])

[2, 3, 4, 5]

In [51]:
# summation of column
def test(x):
    return x.sum()
df1.apply(test)

a                     14
b                     20
c                     20
d    sudhpawankrishnavin
dtype: object

In [53]:
def test(x):
    return x.sum()
df1.apply(test , axis=1)
#  now it will give problem , because string and interger can't be sum

TypeError: unsupported operand type(s) for +: 'int' and 'str'

In [58]:
df2 = df1[['a' , 'b']]
df2

   a  b
x  2  8
y  3  6
z  4  4
u  5  2

In [60]:
df2.applymap(lambda x : x**2)
# apply on each and every elelment

    a   b
x   4  64
y   9  36
z  16  16
u  25   4

In [61]:
df1

   a  b  c      d
x  2  8  8   sudh
y  3  6  5  pawan
z  4  4  2  krish
u  5  2  5  navin

In [64]:
# Sorting  base on column 'c'
df1.sort_values('c')

   a  b  c      d
z  4  4  2  krish
y  3  6  5  pawan
u  5  2  5  navin
x  2  8  8   sudh

In [65]:
df1.sort_index()

   a  b  c      d
u  5  2  5  navin
x  2  8  8   sudh
y  3  6  5  pawan
z  4  4  2  krish

In [66]:
df1.sort_index(ascending = False)

   a  b  c      d
z  4  4  2  krish
y  3  6  5  pawan
x  2  8  8   sudh
u  5  2  5  navin

In [78]:
df3=pd.DataFrame(
{
'dec':["Short notes are quick to write and correct, tightly focused, and easy to review, and can be read (and comprehended) rapidly; therefore, they have the potential to reach a wide audience." , "my name is pawan" , "this is data science class"],
})

In [79]:
df3
# can't be able to show complete data

                                                                                                                                                                                         dec
0  Short notes are quick to write and correct, tightly focused, and easy to review, and can be read (and comprehended) rapidly; therefore, they have the potential to reach a wide audience.
1                                                                                                                                                                           my name is pawan
2                                                                                                                                                                 this is data science class

In [80]:
pd.set_option("display.max_colwidth" , 500)

In [81]:
df3

                                                                                                                                                                                         dec
0  Short notes are quick to write and correct, tightly focused, and easy to review, and can be read (and comprehended) rapidly; therefore, they have the potential to reach a wide audience.
1                                                                                                                                                                           my name is pawan
2                                                                                                                                                                 this is data science class

In [82]:
df3

                                                                                                                                                                                         dec
0  Short notes are quick to write and correct, tightly focused, and easy to review, and can be read (and comprehended) rapidly; therefore, they have the potential to reach a wide audience.
1                                                                                                                                                                           my name is pawan
2                                                                                                                                                                 this is data science class

In [85]:
df3['len']  = df3['dec'].apply(len)

In [86]:
df3

,dec,len
0,"Short notes are quick to write and correct, tightly focused, and easy to review, and can be read (and comprehended) rapidly; therefore, they have the potential to reach a wide audience.",185
1,my name is pawan,16
2,this is data science class,26

In [87]:
t = "this is data science class	"
t.split()

['this', 'is', 'data', 'science', 'class']

In [90]:
df3['word_count']  =df3['dec'].apply(lambda x : len(x.split()))

In [91]:
df3

,dec,len,word_count
0,"Short notes are quick to write and correct, tightly focused, and easy to review, and can be read (and comprehended) rapidly; therefore, they have the potential to reach a wide audience.",185,31
1,my name is pawan,16,4
2,this is data science class,26,5

In [92]:
df

   a  b  c      d
0  2  8  8   sudh
1  3  6  5  pawan
2  4  4  2  krish
3  5  2  5  navin

In [93]:
df['a'].mean() #average of cloumn a

3.5

In [95]:
df['a'].median()

3.5

In [96]:
df['a'].mode()

0    2
1    3
2    4
3    5
Name: a, dtype: int64

In [97]:
df['a'].std()

1.2909944487358056

In [98]:
df['a'].sum()

14

In [99]:
df['a'].min()

2

In [100]:
df['a'].max()

5

In [101]:
df['a'].var()

1.6666666666666667

In [103]:
df4 = pd.DataFrame(
{
'a':[6,4,8,5,6,3,5,3]
})

In [104]:
# Windows Function
df4['a']

0    6
1    4
2    8
3    5
4    6
5    3
6    5
7    3
Name: a, dtype: int64

In [111]:
df4['a'].rolling(window = 1).mean()

0    6.0
1    4.0
2    8.0
3    5.0
4    6.0
5    3.0
6    5.0
7    3.0
Name: a, dtype: float64

In [112]:
df4['a'].rolling(window = 2).mean()

0    NaN
1    5.0
2    6.0
3    6.5
4    5.5
5    4.5
6    4.0
7    4.0
Name: a, dtype: float64

In [113]:
df4['a'].rolling(window = 3).mean()

0         NaN
1         NaN
2    6.000000
3    5.666667
4    6.333333
5    4.666667
6    4.666667
7    3.666667
Name: a, dtype: float64

In [114]:
df4['a'].rolling(window = 3).sum()

0     NaN
1     NaN
2    18.0
3    17.0
4    19.0
5    14.0
6    14.0
7    11.0
Name: a, dtype: float64

In [116]:
df4['a'].rolling(window = 4).min()

0    NaN
1    NaN
2    NaN
3    4.0
4    4.0
5    3.0
6    3.0
7    3.0
Name: a, dtype: float64

In [120]:
# cumalitive sum = sum + previous sum
df4['a'].cumsum()

0     6
1    10
2    18
3    23
4    29
5    32
6    37
7    40
Name: a, dtype: int64

In [121]:
df4

   a
0  6
1  4
2  8
3  5
4  6
5  3
6  5
7  3

In [123]:
# Python Pandas - DataFunctionality
date = pd.date_range(start = '2023-04-23' , end = '2023-06-23')

In [124]:
date

DatetimeIndex(['2023-04-23', '2023-04-24', '2023-04-25', '2023-04-26',
               '2023-04-27', '2023-04-28', '2023-04-29', '2023-04-30',
               '2023-05-01', '2023-05-02', '2023-05-03', '2023-05-04',
               '2023-05-05', '2023-05-06', '2023-05-07', '2023-05-08',
               '2023-05-09', '2023-05-10', '2023-05-11', '2023-05-12',
               '2023-05-13', '2023-05-14', '2023-05-15', '2023-05-16',
               '2023-05-17', '2023-05-18', '2023-05-19', '2023-05-20',
               '2023-05-21', '2023-05-22', '2023-05-23', '2023-05-24',
               '2023-05-25', '2023-05-26', '2023-05-27', '2023-05-28',
               '2023-05-29', '2023-05-30', '2023-05-31', '2023-06-01',
               '2023-06-02', '2023-06-03', '2023-06-04', '2023-06-05',
               '2023-06-06', '2023-06-07', '2023-06-08', '2023-06-09',
               '2023-06-10', '2023-06-11', '2023-06-12', '2023-06-13',
               '2023-06-14', '2023-06-15', '2023-06-16', '2023-06-17',
               '2023-06-18', '2023-06-19', '2023-06-20', '2023-06-21',
               '2023-06-22', '2023-06-23'],
              dtype='datetime64[ns]', freq='D')

In [130]:
# convert date into dataframe
df5 = pd.DataFrame({'date' :date})
df5

         date
0  2023-04-23
1  2023-04-24
2  2023-04-25
3  2023-04-26
4  2023-04-27
..        ...
57 2023-06-19
58 2023-06-20
59 2023-06-21
60 2023-06-22
61 2023-06-23

[62 rows x 1 columns]

In [132]:
df6 = pd.DataFrame({
     "date": ['2023-06-23' , '2023-06-22' , '2023-06-20']
})
df6

         date
0  2023-06-23
1  2023-06-22
2  2023-06-20

In [128]:
df6.dtypes
# it is not in the form of date

date    object
dtype: object

In [131]:
df5.dtypes

date    datetime64[ns]
dtype: object

In [134]:
# convert all string object into date and time
df6['updated_date'] = pd.to_datetime(df6['date'])

In [135]:
df6

         date updated_date
0  2023-06-23   2023-06-23
1  2023-06-22   2023-06-22
2  2023-06-20   2023-06-20

In [136]:
df6.dtypes

date                    object
updated_date    datetime64[ns]
dtype: object

In [139]:
# seperation of monthe , date and day
df6['year']  = df6['updated_date'].dt.year
df6

         date updated_date  year
0  2023-06-23   2023-06-23  2023
1  2023-06-22   2023-06-22  2023
2  2023-06-20   2023-06-20  2023

In [140]:
df6['day']  = df6['updated_date'].dt.day
df6['month']  = df6['updated_date'].dt.month

In [141]:
df6

         date updated_date  year  day  month
0  2023-06-23   2023-06-23  2023   23      6
1  2023-06-22   2023-06-22  2023   22      6
2  2023-06-20   2023-06-20  2023   20      6

In [144]:
# Python pandas - Time Delta
pd.Timedelta(days = 1 , hours = 5, minutes = 45)

Timedelta('1 days 05:45:00')

In [145]:
dt = pd.to_datetime('2023-06-23')

In [146]:
dt

Timestamp('2023-06-23 00:00:00')

In [151]:
td = pd.Timedelta(days = 1, hours = 5, minutes = 45)

In [152]:
dt+td

Timestamp('2023-06-24 05:45:00')

In [153]:
# Python Pandas -  Categorical Data
data = ['sudh' , 'krish', ' navin','hitesh','sudh','sudh','sudh']

In [156]:
cat = pd.Categorical(data)
cat

['sudh', 'krish', ' navin', 'hitesh', 'sudh', 'sudh', 'sudh']
Categories (4, object): [' navin', 'hitesh', 'krish', 'sudh']

In [157]:
cat.value_counts()

 navin    1
hitesh    1
krish     1
sudh      4
dtype: int64

In [ ]:
# Python pandas - Visulations